// 0 Напишите программу, которая на вход принимает число 
// и выдаёт его квадрат (число умноженное на само себя).
Console.WriteLine("Введите число:");
double num = Convert.ToDouble(Console.ReadLine());
double result = num * num;
Console.WriteLine(" Квадрат введённого числа = " + result);
